In [1]:
import numpy as np
import pandas as pd

In [2]:
print(pd.__version__)

2.1.1

In [3]:
list=[1,2,23]
pd.Series(list)

0     1
1     2
2    23
dtype: int64

In [6]:
name=["rav","raj","Riya","Manoj"]
pd.Series(name,index=["a","b","c","d"])

a      rav
b      raj
c     Riya
d    Manoj
dtype: object

In [7]:
studentMks={"Ravi":23,"Geeta":90,"Rah":89}
pd.Series(studentMks)

Ravi     23
Geeta    90
Rah      89
dtype: int64

In [8]:
arr=np.arange(2,6)

In [9]:
arr

array([2, 3, 4, 5])

In [10]:
df=pd.DataFrame()

In [11]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [14]:
river={'Ganga':['Himachal Prades','Uttar Prades','Bengal','Bhiahr'],'Codes':[1,2,3,4]}

In [15]:
dp=pd.DataFrame(river)

In [16]:
dp

             Ganga  Codes
0  Himachal Prades      1
1     Uttar Prades      2
2           Bengal      3
3           Bhiahr      4

In [17]:
arra=np.array([[1,2,3,4],[5,6,7,8],[9,10,11,12]])
print(pd.DataFrame(arra))

   0   1   2   3
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [19]:
pd.DataFrame(arra,columns=["c1","c2","c3","c4"])

   c1  c2  c3  c4
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12